cfg/InformationRegisters/НастройкаОбновленияВидовРасчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>НастройкаОбновленияВидовРасчета</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НеОбновлятьАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеОбновлятьТабличныеЧасти</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПланВидовРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПланыВидовРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.УдержанияОрганизаций</v8:Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.ВзносыВФонды</v8:Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.СреднийЗаработок</v8:Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.ОсновныеНачисленияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfg/Enums/ПланыВидовРасчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ПланыВидовРасчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновныеНачисленияОрганизаций</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдержанияОрганизаций</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносыВФонды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СреднийЗаработок</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfg/InformationRegisters/НастройкаОбновленияВидовРасчета/Forms/ФормаСписка/Ext/Form/Module.bsl
Процедура РегистрСведенийСписокПланВидовРасчетаПриИзменении(Элемент)
	
	ТекущиеДанные = ЭлементыФормы.РегистрСведенийСписок.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ТекущиеДанные.ПланВидовРасчета = Перечисления.ПланыВидовРасчета.ОсновныеНачисленияОрганизаций Тогда
		Если ТипЗнч(ТекущиеДанные.ВидРасчета) <> Тип("ПланВидовРасчетаСсылка.ОсновныеНачисленияОрганизаций") Тогда
			ТекущиеДанные.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ПустаяСсылка();
		КонецЕсли;	
	ИначеЕсли ТекущиеДанные.ПланВидовРасчета = Перечисления.ПланыВидовРасчета.УдержанияОрганизаций Тогда
		Если ТипЗнч(ТекущиеДанные.ВидРасчета) <> Тип("ПланВидовРасчетаСсылка.УдержанияОрганизаций") Тогда
			ТекущиеДанные.ВидРасчета = ПланыВидовРасчета.УдержанияОрганизаций.ПустаяСсылка();
		КонецЕсли;
	ИначеЕсли ТекущиеДанные.ПланВидовРасчета = Перечисления.ПланыВидовРасчета.ВзносыВФонды Тогда
		Если ТипЗнч(ТекущиеДанные.ВидРасчета) <> Тип("ПланВидовРасчетаСсылка.ВзносыВФонды") Тогда
			ТекущиеДанные.ВидРасчета = ПланыВидовРасчета.ВзносыВФонды.ПустаяСсылка();
		КонецЕсли;		
	ИначеЕсли ТекущиеДанные.ПланВидовРасчета = Перечисления.ПланыВидовРасчета.СреднийЗаработок Тогда
		Если ТипЗнч(ТекущиеДанные.ВидРасчета) <> Тип("ПланВидовРасчетаСсылка.СреднийЗаработок") Тогда
			ТекущиеДанные.ВидРасчета = ПланыВидовРасчета.СреднийЗаработок.ПустаяСсылка();
		КонецЕсли;		
	КонецЕсли;	
	
КонецПроцедуры


Процедура РегистрСведенийСписокПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = ЭлементыФормы.РегистрСведенийСписок.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.ПланВидовРасчета) Тогда
		ТекущиеДанные.ПланВидовРасчета = Перечисления.ПланыВидовРасчета.ОсновныеНачисленияОрганизаций;
	КонецЕсли;	
	Если ТекущиеДанные.ПланВидовРасчета = Перечисления.ПланыВидовРасчета.ОсновныеНачисленияОрганизаций Тогда
		Если ТипЗнч(ТекущиеДанные.ВидРасчета) <> Тип("ПланВидовРасчетаСсылка.ОсновныеНачисленияОрганизаций") Тогда
			ТекущиеДанные.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ПустаяСсылка();
		КонецЕсли;	
	ИначеЕсли ТекущиеДанные.ПланВидовРасчета = Перечисления.ПланыВидовРасчета.УдержанияОрганизаций Тогда
		Если ТипЗнч(ТекущиеДанные.ВидРасчета) <> Тип("ПланВидовРасчетаСсылка.УдержанияОрганизаций") Тогда
			ТекущиеДанные.ВидРасчета = ПланыВидовРасчета.УдержанияОрганизаций.ПустаяСсылка();
		КонецЕсли;
	ИначеЕсли ТекущиеДанные.ПланВидовРасчета = Перечисления.ПланыВидовРасчета.ВзносыВФонды Тогда
		Если ТипЗнч(ТекущиеДанные.ВидРасчета) <> Тип("ПланВидовРасчетаСсылка.ВзносыВФонды") Тогда
			ТекущиеДанные.ВидРасчета = ПланыВидовРасчета.ВзносыВФонды.ПустаяСсылка();
		КонецЕсли;		
	ИначеЕсли ТекущиеДанные.ПланВидовРасчета = Перечисления.ПланыВидовРасчета.СреднийЗаработок Тогда
		Если ТипЗнч(ТекущиеДанные.ВидРасчета) <> Тип("ПланВидовРасчетаСсылка.СреднийЗаработок") Тогда
			ТекущиеДанные.ВидРасчета = ПланыВидовРасчета.СреднийЗаработок.ПустаяСсылка();
		КонецЕсли;		
	КонецЕсли;
	
	
КонецПроцедуры
